[{"yes_rsvp_count":18,"time":1342132200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/71573212/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a></p> <p>Our main meeting will start at 7pm. The topic of discussion for our meeting will be everything with images for iOS by Jeff Kelley of Detroit Labs. From simple UIImage calls to working with raw pixel data and everything in between. We’ll look at when to use different APIs, how to resize images intelligently, and how to render graphics for a Retina display. Finally, we’ll see a preview of some upcoming open-source efforts from Detroit Labs.</p> <p>If you are interested in talking about an iPhone or Mac OS X development topic, or showing your iPhone or Mac OS X project please contact <a href=\"mailto:[masked]\">Dave Koziol</a>.</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> <p> </p> ","name":"Everything With Images for iOS","id":"71573212"},{"yes_rsvp_count":11,"time":1344551400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/75562462/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc</p> <p>Our main meeting will start at 7pm. The topic of discussion for our meeting will be a Beginners Guide to Parsing RSS by Don Miller of JADR Consulting.</p> <p>You don't need to be an expert to create an iOS app from a RSS feed. Our journey will begin by creating a RSS parser class and NSLogging output to test it out.  Once that milestone is complete, we will then use that class to create an iPhone app to display the top 100 movies from Netflix.  Work along and/or use github for the code later.</p> <p>Don Miller is the President of JADR Consulting.  He has over 18 years of professional experience in addition to the sale of his first program (spaghetti code) at the age of 14.  His broad range of experience makes him very relatable to programmers and system engineers.  He is a crazed social networker within the nerd community, one of the founding partners of Seed Coworking in Toledo, and teaches iOS Application development at the University of Toledo.  You can find him online easily with Twitter or LinkedIn.</p> <p>If you are interested in talking about an iPhone or Mac OS X development topic, or showing your iPhone or Mac OS X project please contact Dave Koziol.</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> ","name":"Beginners Guide to Parsing RSS","id":"75562462"},{"yes_rsvp_count":24,"time":1347575400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/75560342/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a></p> <p>Our main meeting will start at 7pm. The topic of discussion for our meeting will be CoreData by Tom Crawford of <a href=\"http://moveablebytes.com\">Moveable Bytes</a>. For many, Core Data is one of the scariest of all iOS technologies. During this session, we'll look at how to set up a database, read &amp; write, handle lightweight migration, and package an initial database with your app.</p> <p>If you are interested in talking about an iPhone or Mac OS X development topic, or showing your iPhone or Mac OS X project please contact <a href=\"mailto:[masked]\">Dave Koziol</a>.</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> <p> </p> ","name":"CoreData","id":"75560342"},{"yes_rsvp_count":23,"time":1349994600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/85472862/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a></p> <p>Our main meeting will start at 7pm. The topic of discussion for our meeting will be What's New with iOS 6 and iPhone 5 by Dave Koziol of <a href=\"http://www.arbormoon.com\">Arbormoon Software, Inc</a>. iOS 6 hit the installed base less than a month ago, and the installed numbers are already huge, and the iPhone 5 added a new screen form factor.  Find out about what's new for developers and how we've been updating some of our apps to deal with the changes.</p> <p>If you are interested in talking about an iPhone or Mac OS X development topic, or showing your iPhone or Mac OS X project please contact <a href=\"mailto:[masked]\">Dave Koziol</a>.</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> <p> </p> ","name":"What's New with iOS 6 and iPhone 5 for Developers","id":"85472862"},{"yes_rsvp_count":26,"time":1352417400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/86674542/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need.</p> <p>Our main meeting will start at 7pm. The topic of discussion for our meeting will be Auto Layout by Mike Woelmer of SRT Solutions.</p> <p>Gone are the days of developing for one screen size and aspect ratio on IOS.  Today we have many new layout challenges that the old auto-resizing mask (aka. springs and struts) can’t handle without writing code.  Now we have Auto Layout, which is a constraint-based descriptive layout system.  This new system allows you to express how your views are related to each other by establishing a set of rules, called constraints.</p> <p>In this session we will look at the problems with the old springs and struts layout system and how they can be fixed, without writing any code with Auto Layout.  We will also look at how to create constraints using interface builder.  Also for more dynamic views, we will look at the syntax for creating constraints in code using the new Visual Format syntax.  Any new system wouldn’t be complete without a few gotchas and Auto Layout is no different.  I will bring these to your attention, so that your first experience with Auto Layout is a pleasant one.</p> <p>We have a <a href=\"http://groups.google.com/group/a2-cocoaheads?lnk=gcimh\">local mailing list</a> please join it to take part in discussions and hear about upcoming meetings.</p> <p><br/>If you are interested in talking about an iPhone or Mac OS X development topic, or showing your iPhone or Mac OS X project please contact <a href=\"mailto:[masked]\">Dave Koziol</a>.</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> <p> </p> ","name":"Auto Layout","id":"86674542"},{"yes_rsvp_count":20,"time":1355441400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/92949882/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need.</p> <p>Our main meeting will start at 7pm. The topic of discussion for our meeting will be HTTP Live Streaming by Chris Adamson.</p> <p>HTTP Live Streaming is Apple's streaming technology that delivers live sports, concerts, tech talks and more to iOS and OS X devices, as well as the Apple TV. In this talk, Chris Adamson will show the server and client-side setup for HLS live and video-on-demand broadcasts, including variant playlists that adapt to clients' different bitrates, and encrypted streams that protect your content. This CocoaHeads talk will itself be livestreamed on Ustream ( <a href=\"http://www.ustream.tv/channel/invalidstream\"><a href=\"http://www.ustream.tv/channel/invalidstream\" class=\"linkified\">http://www.ustream.tv/channel/invalidstream</a></a> )</p> <p>We have a <a href=\"http://groups.google.com/group/a2-cocoaheads?lnk=gcimh\">local mailing list</a> please join it to take part in discussions and hear about upcoming meetings.</p> <p>If you are interested in talking about an iPhone or Mac OS X development topic, or showing your iPhone or Mac OS X project please contact <a href=\"mailto:[masked]\">Dave Koziol</a>.</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> ","name":"HTTP Live Streaming, Streamed","id":"92949882"},{"yes_rsvp_count":13,"time":1357860600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/98506322/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need.</p> <p>Our main meeting will start at 7pm. The topic of discussion for our meeting will be Getting Pushy or Push Notifications by Dave Koziol of Arbormoon Software, Inc.</p> <p>Push Notifications are a staple of many iOS applications. In this talk, we'll cover what it takes to get them flowing. While the focus will be on the iOS side of the process, we'll touch on some of the server issues as well.</p> <p>We have a <a href=\"http://groups.google.com/group/a2-cocoaheads?lnk=gcimh\">local mailing list</a> please join it to take part in discussions and hear about upcoming meetings.</p> <p>If you are interested in talking about an iPhone or Mac OS X development topic, or showing your iPhone or Mac OS X project please contact <a href=\"mailto:[masked]\">Dave Koziol</a>.</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> <p> </p> ","name":"Getting Pushy or Push Notifications","id":"98506322"},{"yes_rsvp_count":40,"time":1361489400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/101282832/","description":"<p>Note that because of Valentine's Day, we are meeting one week later than normal.</p> <p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need.</p> <p>Our main meeting will start at 7pm. The topic of discussion for our meeting will be UICollectionViews by Luke Geiger.</p> <p>Luke will cover what a UICollectionView is, show some examples of them in apps.  Then he will go over how to implement them in your apps, with all the steps and common mistakes that might occur.</p> <p>Luke Geiger has been developing on iOS for three years. In the past he's worked for UpTo and done some freelance work. Right now he's working on getting his own startup off the ground. He has also served as an instructor for Develop Detroit.</p> <p>If you are interested in talking about an iPhone or Mac OS X development topic, or showing your iPhone or Mac OS X project please contact <a href=\"mailto:[masked]\">Dave Koziol</a>.</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> <p> </p> ","name":"UICollectionViews","id":"101282832"},{"yes_rsvp_count":30,"time":1363300200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/107786272/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.techsmith.com\">TechSmith</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm.  Based on the overwhelmingly positive feedback, it will feature a roundup of tips from our community of Cocoa developers.</p> <p>Eric Shapiro, Dan Hibbitts, Chris Adamson, Dave Koziol and many more have all promised to show something to improve your development experience, and you can join in too.  At the end of the evening we'll vote on the best tip and award an awesome prize.  So, get your tip ready, and we'll see you on Thursday night (3/14).</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> <p> </p> ","name":"Objective Tips","id":"107786272"},{"yes_rsvp_count":36,"time":1365719400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/109823542/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.techsmith.com/\">TechSmith</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a talk on In-App Purchases by Tod Cunningham.</p> <p>Today there are many ways to approach app monetization and a popular one is freemium with in-app purchases.  In this talk, we'll cover some practical advice and pitfalls of in-app purchases.   We will also dive into a shipping code example and share code and tips that will allow you to implement your own non-consumable in-app purchases.</p> <p>During the day, Tod Cunningham is the Director of Development for TechSmith’s desktop products.  In the evening, Tod is co-founder of <a href=\"http://www.fivelakesstudio.com\">Five Lakes Studio, LLC</a>.  Five Lakes Studio was started as a place to learn, build, and launch mobile applications.  They have focused on building fun casual games for the iPhone and iPad such as Euchre HD, Picross HD, Kento, and Droptzee.  Tod has over 20 year of experience in software development and management in small and large organizations.</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> <p> </p> ","name":"In App Purchases","id":"109823542"},{"yes_rsvp_count":25,"time":1368138600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/111667432/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a talk on Azure Mobile Services for iOS by Jennifer Marsman.</p> <p>Windows Azure Mobile Services gives you a ton of backend services for use with your mobile apps. You can quickly create a database in the cloud, use authentication services, and send push notifications to users, to name a few. Your cloud backend also has the reliability, scale, and diagnostics of Azure. Azure provides client SDKs for iOS, Android, Windows 8, Windows Phone 8, and a newly-announced library for HTML5 which can reach any device.</p> <p>Jennifer Marsman is a Principal Developer Evangelist in Microsoft’s Developer and Platform Evangelism group, where she educates developers on Microsoft’s new technologies. In this role, Jennifer is a frequent speaker at software development conferences across the United States. In 2009, Jennifer was chosen as \"Techie whose innovation will have the biggest impact\" by X-OLOGY for her work with GiveCamps, a weekend-long event where developers code for charity. In her 10 years with the company, she has also received many honors from Microsoft, including the Central Region Top Contributor Award, Heartland District Top Contributor Award, DPE Community Evangelist Award, CPE Champion Award, MSUS Diversity &amp; Inclusion Award, and Gold Club. Prior to becoming a Developer Evangelist, Jennifer was a software developer in Microsoft’s Natural Interactive Services division. In this role, she earned two patents for her work in search and data mining algorithms. Jennifer has also held positions with Ford Motor Company, National Instruments, and Soar Technology. Jennifer holds a Bachelor’s Degree in Computer Engineering and Master’s Degree in Computer Science and Engineering from the University of Michigan in Ann Arbor. Her graduate work specialized in artificial intelligence and computational theory. Jennifer blogs at <a href=\"http://blogs.msdn.com/jennifer\" class=\"linkified\">http://blogs.msdn.com/jennifer</a> and tweets at <a href=\"http://twitter.com/jennifermarsman\" class=\"linkified\">http://twitter.com/jennifermarsman</a>.</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> ","name":"Azure Mobile Services for iOS Apps","id":"111667432"},{"yes_rsvp_count":8,"time":1370883600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/123877582/","description":"<p>Apple waited until the last minute to announce that they would live stream the keynote. So, we had to wait to the last minute to announce that you can come watch the live stream of the keynote with other CocoaHeads in the Mobile Den.</p> <p>Eat lunch early, or bring some food.</p> ","name":"WWDC Keynote Live Stream","id":"123877582"},{"yes_rsvp_count":25,"time":1371767400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/122550602/","description":"<p>NOTE: This meeting is one week later than normal!</p> <p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a recap of public information from the recent WWDC conference by members that attended in person.  Rather than a presentation, this meeting will be run more as an interactive discussion, lead by Gavin Eadie.</p> <p>We would love for everyone who would like to share something new and/or interesting that they learned either during the event or simply reviewing YouTube videos afterward to participate.</p> <p>If you are able to assist in co-recapping, you may contact our organizer to coordinate. Or you can just show up and join the discussion!</p> <p>At 10pm, Young Frankenstein will be showing at Ann Arbor Summer Festival after our meeting.</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> <p>\n\n </p> <p> </p> ","name":"WWDC Roundup","id":"122550602"},{"yes_rsvp_count":23,"time":1373581800000,"link":"https://www.meetup.com/A2-CocoaHeads/events/127980092/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a talk on Continuous Integration with <a href=\"http://jenkins-ci.org\">Jenkins</a> by Matthew Ko of <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>.</p> <p>Jenkins is an easy-to-use so-called continuous integration system, making it easier for developers to integrate changes to the project, and making it easier for users to obtain a fresh build. The automated, continuous build increases the productivity.</p> <p>Matthew Ko is a Software Engineering Intern working for Arbormoon Software, Inc.</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> ","name":"Continuous Integration with Jenkins","id":"127980092"},{"yes_rsvp_count":14,"time":1376001000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/133486662/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a talk on Analytics by Dave Koziol of <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>.</p> <p>What, When, Where and for How long? These questions and more can be answered by including Analytics in your iOS apps. In this talk, we'll look at how to add Flurry and/or Google Analytics to your app. Then we'll look at what data you can collect to make better decisions about the future of your iOS apps.</p> <p>Dave Koziol has been building Cocoa Apps since long before it was cool. He's worked on large and small projects for both iOS and Mac OS X. Dave is President of <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc.</a>, a company which specializes in helping build mobile solutions for their clients.  </p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> ","name":"Analytics for iOS","id":"133486662"},{"yes_rsvp_count":23,"time":1379025000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/138754892/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://detroitlabs.com\">Detroit Labs</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a talk on ARC by Eric Shapiro of <a href=\"http://www.relium.com\">Relium Corporation</a>, a demo Location Tools and a little code by Tom Crawford of <a href=\"http://www.moveablebyte.com\">Moveable Bytes</a>, and some discussion of the Apple September 10th and 11th announcements.</p> <p>Eric Shapiro will discuss Automatic Reference Counting (ARC) in Objective-C and how it makes your code easier to write, easier to read, and more reliable. He will also discuss updating older code to ARC, selectively using ARC on new code only, and other ARC-related topics.</p> <p><br/>Eric Shapiro is President of Relium Corporation, a company specializing in custom iOS and Mac applications.</p> <p><br/>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> ","name":"ARC and more...","id":"138754892"},{"yes_rsvp_count":18,"time":1381444200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/144297532/","description":"<p>NOTE: We're using an alternative location this month! See you at Ann Arbor SPARK, where Mobile Monday meetings are normally held.</p> <p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature an Introduction to iOS automated testing using UI Automations Framework by Priya Rajagopal of <a href=\"https://www.barracuda.com\">Barracuda Networks</a>.</p> <p>UI Automations is an automated functional test framework from Apple that uses scripts to drive UI interactions with your iOS app. This talk will cover the basics of how you can automate UI testing of your apps using UI Automations and how you can use Instruments to run your scripts. </p> <p>Priya Rajagopal is a Principal Software Developer at Barracuda Networks working on iOS mobile development. She also moonlights as a freelance iOS developer and mentor. She has over fourteen years of software development experience and has co-invented 21 US patents. You can read more at <a href=\"http://www.priyaontech.com/\">www.priyaontech.com</a> and follow her on Twitter @rajagp</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> ","name":"Introduction to iOS automated testing using UI Automations Framework","id":"144297532"},{"yes_rsvp_count":43,"time":1384471800000,"link":"https://www.meetup.com/A2-CocoaHeads/events/147784532/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a talk on Understanding Objective-C Inside and Out by Jeff Kelley of <a href=\"http://www.detroitlabs.com\">Detroit Labs</a>.</p> <p>How many times have you tried to debug something in Objective-C without really knowing *why* it works a certain way? Do you start sweating when Xcode throws linker errors your way, or when you have to mix ARC and non-ARC code? This talk will reveal how Objective-C works, what actually happens when your application is linked, and reveal what ARC is actually doing. Objective-C is a 30-year-old language, and it’s evolving faster than ever. We’ll look at the basics of the language, how properties and categories work, and cover advanced topics like creating classes at runtime, memory management and ARC, and tagged pointers. At the end of the talk, you’ll be able to diagnose issues with your app more quickly, dive into system components more readily, and have a better sense of why your code works.</p> <p>Jeff Kelley is an iOS developer at Detroit Labs and author of Learn Cocoa Touch for iOS, published by Apress. He’s been working with iOS since its infancy in 2008, and managed the OS X environment at the University of Michigan before that. When not working on iOS apps, Jeff listens to an inordinate amount of podcasts and seeks out new and interesting races to run; he finished his first half marathon in October.</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> ","name":"Understanding Objective-C Inside and Out","id":"147784532"},{"yes_rsvp_count":25,"time":1386891000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/150957122/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://atomicobject.com\">Atomic Object</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a talk on Auto Layout - Part Deux by Mike Woelmer of Atomic Object.</p> <p>The first edition of Auto Layout could be considered a comedy or even a tragedy. With the updates in Xcode 5 and IOS 7, the sequel is bound to be a blockbuster hit (maybe). The fundamentals are the same, but the tooling has improved immensely. In this deeper dive into Auto Layout, we will look at some practical examples of how to make use of this powerful but sometimes frustrating layout system.</p> <p>Mike Woelmer is a senior software consultant for Atomic Object, Ann Arbor. He has more than a decade of experience in the field working for both small companies, video game development, and global businesses. His current passion is in developing IOS applications.</p> ","name":"Auto Layout - Part Deux","id":"150957122"},{"yes_rsvp_count":6,"time":1389312000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/159269602/","description":"<p>We're doing something different for January, with all of the cold, snow and a conflict with CodeMash. We're meeting for dinner and drinks at Blue Tractor at 7pm. Blue Tractor is just around the corner from our regular meeting location, and you can park in all of the same spots.</p> <p>There will be no formal presentation, but I'm sure there will be lots of geek discussions.  </p> <p>If you plan to attend, please RSVP. If you change your mind, please update your RSVP.</p> <p>We plan to return to our regular format in February.</p> ","name":"CocoaHeads Dinner & Drinks","id":"159269602"},{"yes_rsvp_count":33,"time":1392334200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/164495692/","description":"<p>New Location! Arbormoon Software has moved, and so has the meeting. 123 N Ashley, Suite 9, on the lower level is the new location.</p> <p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a talk on Dates and Times in Cocoa by Jeff Kelley.</p> <p>Date and time APIs are notoriously difficult, even though we all have an intimate understanding of the problem domain. Why is it so hard to get right in an app, yet so easy to reason about? How could Apple screw up alarms around Daylight Savings Time more than once? In this talk, we’ll take a tour of the time and date APIs in Cocoa and Cocoa Touch, solve some common problems, and figure out why things aren’t always as easy as they seem to be.</p> <p>Jeff Kelley is an iOS developer at Detroit Labs and author of Learn Cocoa Touch for iOS, published by Apress. He’s been working with iOS since its infancy in 2008, and managed the OS X environment at the University of Michigan before that. Apps he’s worked on that you’ve likely seen are the Domino’s Pizza iOS ordering app, the award-winning Chevy Game Time second-screen Super Bowl experience, and the DTE Energy outage center app. When not working on iOS apps, Jeff listens to an inordinate amount of podcasts and seeks out new and interesting races to run, recently completing his first half marathon.</p> ","name":"Dates and Times in Cocoa","id":"164495692"},{"yes_rsvp_count":38,"time":1394749800000,"link":"https://www.meetup.com/A2-CocoaHeads/events/159742142/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a talk on Developer Tools by Luke Geiger.</p> <p>Luke Geiger is an iOS Developer at <b>6th Man Apps</b>. He also teaches an iOS class for <b>Grand Circus</b> in downtown Detroit.</p> <p>______________________________________________________</p> <p>Lets be honest, most developers are lazy. We don't want to waste time using inefficient debugging tactics or integrating huge third party libraries... Lucky for us there are some tools.</p> <p><b>Cocoa Pods:</b> The cool way to integrate third parties nowadays. With one line you can bring in an entire project without fidgeting with dependencies, etc. Cocoa Pods is a dependency manager for Objective-C projects. It has thousands of libraries and can help you scale your projects elegantly... We will discover how to use Cocoa Pods and also how to create one...</p> <p><b>Apple Instruments:</b> With instruments you use special tools to trace different aspects of a process' behavior. You can also use a tool to record a sequence of user interface actions and replay them. With Instruments you have the ability to:<br/>* Track down difficult to reproduce problems in code.<br/>* Performance analysis.<br/>* Stress test parts of your app.<br/>* Gain a deeper understanding of how your app works.</p> ","name":"Developer Tools","id":"159742142"},{"yes_rsvp_count":26,"time":1397169000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/175246852/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com\">Arbormoon Software, Inc.</a> Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a talk on Stupid Video Tricks by Chris Adamson.</p> <p>AV Foundation makes it reasonably straightforward to capture video from the camera and edit together a nice family video. <i>This session is not about that stuff.</i> This session is about the nooks and crannies where AV Foundation exposes what's behind the curtain. Instead of letting AVPlayer read our video files, we can grab the samples ourselves and mess with them. </p> <p>AVCaptureVideoPreviewLayer, meet the CGAffineTransform. And instead of dutifully passing our captured video frames to the preview layer and an output file, how about if we instead run them through a series of Core Image filters? Record your own screen? Oh yeah, we can AVAssetWriter that. With a few pointers, a little experimentation, and a healthy disregard for safe coding practices, Core Media and Core Video let you get away with some neat stuff.</p> <p>Chris Adamson is an independent writer, editor, and developer, living in Grand Rapids, Michigan. Along with developing numerous App Store apps for clients, he is the co-author of <a href=\"http://pragprog.com/titles/adios\">iPhone SDK Development</a> (Pragmatic Programmers) and <a href=\"http://is.gd/UEDYe4\">Learning Core Audio</a> (Addison-Wesley Professional). He maintains a corporate identity as <a href=\"http://www.subfurther.com/\">Subsequently &amp; Furthermore, Inc.</a> and writes <a href=\"http://www.subfurther.com/blog\">the [Time code]; blog</a> at <a href=\"http://www.subfurther.com/blog\"><a href=\"http://www.subfurther.com/blog\" class=\"linkified\">http://www.subfurther.com/blog</a></a>. In a previous career, he was a Writer / Associate Producer at CNN Headline News, and over the years, he has managed to own thirteen and a half Macs.</p> ","name":"Stupid Video Tricks","id":"175246852"},{"yes_rsvp_count":21,"time":1399588200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/178792482/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc.</a> Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm, and will feature three short talks.</p> <p><b>Dynamic Type</b></p> <p>OS7 introduced us to called “Dynamic Type”. Using this technology, apps can dynamically react to users’ text size preferences by adjusting the size of displayed text content. This enhances readability and makes your apps more accessible. This talk will provide an overview of this technology and will walk you through the steps to support this capability within your iOS apps.</p> <p>Priya Rajagopal has been professionally building software for over 14 years spanning a variety of technologies. Her current focus is on mobile development. She is a Principal Software Developer at Barracuda Networks and in her own time, does iOS app development, consulting and mentoring through her company, Lunaria Software. You can read more about her work on <a href=\"http://www.priyaontech.com/\">www.priyaontech.com</a> and follow her on twitter @rajagp.</p> <p><b>Pixate</b></p> <p><br/>Pixate was founded in May 2012 by Paul Colton and Kevin Lindsey with the goal of enabling designers and developers alike to quickly and easily create beautiful, native mobile interfaces. Their latest product FreeStyle is a simple, powerful way to define a native app's look and feel, using CSS. It's 100% native, open source, and works with iOS and Android. Today Leo Dion will be giving a basic tutorial on how to start using Freestyle, as well as its features, issues, and how it can fit in your mobile development process. </p> <p>Leo Dion is a freelance mobile and web consultant who lives in Lansing. He started his company BrightDigit in 2012 and specializes in JavaScript and iOS development. He is married and has two little kids who keep him active and busy. He is interested in learning more about mobile development and how new technologies fit for both the user and software developer.</p> <p><br/><b>TBA</b></p> ","name":"Short Talks","id":"178792482"},{"duration":10800000,"yes_rsvp_count":7,"time":1401728400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/185947882/","description":"<p>Apple's World Wide Developer Conference starts Monday, and Apple will live stream the keynote.  Come watch it with other CocoaHeads at the Arbormoon Office. </p> <p>We'll setup the room with desks, so you can bring a laptop, and a lunch or beverage. Sorry no food sponsor for this meeting.</p> ","name":"WWDC Keynote","id":"185947882"},{"duration":7200000,"yes_rsvp_count":28,"time":1402612200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/185948402/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm, and will feature a discussion of what happened at WWDC. This will be a facilitated discussion style event. We expect to have a couple developers in attendance who attended WWDC, but anyone can contribute.</p> ","name":"WWDC Recap","id":"185948402"},{"yes_rsvp_count":39,"time":1405031400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/189380512/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a talk on Swift by Ravi Desai.</p> <p>Swift is a new programming language from Apple. This talk will focus on helping Objective-C developers understand it.</p> <p>Ravi Desai has been actively developing software in the Southeastern, MI for more years than he can remember. Ever since the introduction of the PowerMac 6600AV he has been programming on Macs in the wee hours of the night. By day he usually worked on various flavors of Unix or Window in some variant of C or Java. He has worked in various industries over that time including Automotive (Johnson Controls), Storage (EMC), Networking (HarmonyCOM), and Healthcare (Siemens). These days he works in Healthcare Information Exchange for a company called Care Evolution doing mostly angular JS and C# coding, although they are just starting up their first iPhone development effort.</p> ","name":"Swift for Objective-C Developers","id":"189380512"},{"yes_rsvp_count":19,"time":1408055400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/199844422/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm.  Based on the overwhelmingly positive feedback, it will feature a roundup of tips from our community of Cocoa developers.</p> <p>Eric Shapiro, Dave Koziol and many more have all promised to show something to improve your development experience, and you can join in too.  Get your tip ready, and we'll see you on Thursday night (8/14).</p> <p>We're always looking for volunteers to talk at future meetings, so please consider volunteering.</p> ","name":"Swift Objective Tips","id":"199844422"},{"yes_rsvp_count":21,"time":1410474600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/204983972/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a talk on Testing by Jeff Burt.</p> <p>Testing is important to the longevity and cleanliness of code. Getting in the automated testing mindset is often frightening and can be stressful. Good news is the Kiwi library is here to make your life much easier. Once you see the flow of things, you will quickly realize that it’s really not that bad.</p> <p>\n\nJeff Burt is an iOS developer at Detroit Labs. After graduating high school, he thought he would become a teacher of some sort. During college, he found a deep love for programming and changed gears. Now that he is established in the programming world, he is trying to give back to the community by talking about his experiences and teaching. Someday he plans to speak at large conferences. </p> ","name":"Testing","id":"204983972"},{"yes_rsvp_count":26,"time":1412893800000,"link":"https://www.meetup.com/A2-CocoaHeads/events/207073972/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a talk on Writing Today Extensions in iOS 8 by Eric Shapiro. Chris Adamson will show an example of writing a iOS 8 custom keyboard extension, from his new book</p> <p>Eric Shapiro owns Relium Corp, and writes software, mostly iOS. He also specializes in short bios...</p> <p>Chris Adamson is a software engineer for <a href=\"http://rev.com/\">Rev.com</a>, and co-author of the books i<i>OS 8 SDK Development</i> and <i>Learning Core Audio</i>. He lives in Grand Rapids, MI.</p> ","name":"Writing Today & Keyboard Extensions in iOS 8","id":"207073972"},{"yes_rsvp_count":1,"time":1413406800000,"link":"https://www.meetup.com/A2-CocoaHeads/events/211616732/","description":"<p>Greetings from the University of Michigan School of Information (UMSI)!</p> <p><br/>At UMSI, we create and share knowledge so that people will use information -- with technology -- to build a better world. Students interested in a graduate degree can receive a Ph.D. in Information, a Master of Science in Information, or a Master of Health Informatics (a joint program with the School of Public Health).</p> <p>With a 99% job placement rate, UMSI students are prepared for impactful jobs in many industries (see <a href=\"https://si.umich.edu/careers/si-salaries\" class=\"linkified\">https://si.umich.edu/careers/si-salaries</a> for more information).</p> <p>Want to learn more or know someone who does?</p> <p>Come to Connect with UMSI, informative sessions for prospective Master's and PhD students:</p> <p>· Thursday, October 16 (5:30-7:45 p.m.): learn about academic programs, admissions, funding, and career development in a shorter version of our Saturday event</p> <p>· Saturday, October 18 (1:30-5:00 p.m.): engage with faculty and current students and learn in-depth about academic programs, admissions, funding, and career development</p> <p>Both Connect with UMSI events will be held in Palmer Commons in Ann Arbor, MI, just a short walk away from North Quad, where UMSI classes are held. Click here for more information and to RSVP: <a href=\"https://www.si.umich.edu/academics/connect-umsi\" class=\"linkified\">https://www.si.umich.edu/academics/connect-umsi</a>. Prospective students are welcome at one or both sessions depending on availability and interest in the program.</p> <p>Students interested in the Master of Health Informatics, a joint program with the School of Public Health, are invited to MHI Prospective Student Day, Saturday, November 8 (1:00-5:00 p.m.) and can learn more and register here: <a href=\"http://healthinformatics.umich.edu/events/mhi-prospective-student-day\" class=\"linkified\">http://healthinformatics.umich.edu/events/mhi-prospective-student-day</a>. MHI Prospective Student Day will be held in North Quad in Ann Arbor, MI.</p> <p>We look forward to seeing you at one of these events!</p> ","name":"Connect with UMSI!","id":"211616732"},{"yes_rsvp_count":17,"time":1415921400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/218616394/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature an intro style coding session.  Dave Koziol will build a simple iOS weather app. Dave will show networking code, JSON parsing, simple persistence, and WebViews. This content was recently part of an intro to iOS course Dave helped teach. While the material is intro in nature, we hope everyone will be able to learn some things or contribute.</p> <p>Dave Koziol is president of Arbormoon Software, and has been building mobile apps since long before it was considered cool. Dave is also an instructor for Mobile Comply, and a regular speaker at conferences both near and far.</p> ","name":"Watch me Code: Building a weather app","id":"218616394"},{"yes_rsvp_count":12,"time":1418340600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/219145620/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature two short talks, and an open question/discussion period. Leo Dion will talk about Reflection with Swift, and Priya Rajagopal will talk about Native Code to Javascript Bridging with WKWebViews. In the remaining time, we'll have a Q&amp;A/Discussion period, so feel free to bring your questions for the group.</p> <p>Have you used reflection in your programming? Looking for classes, methods, implementations within your libraries using code. Today Leo will be exploring how to do that in Swift using the Objective-C Runtime. He will talk about the caveats and complexities of using reflection to create code for pluggable, reusable libraries and applications.</p> <p>Leo Dion is a freelance mobile and web consultant who lives in Lansing. He started his company BrightDigit in 2012 and specializes in JavaScript and iOS development. He is married and has two little kids who keep him active and busy. He is interested in learning more about mobile development and how new technologies fit for both the user and software developer.</p> <p>Priya Rajagopal has been professionally developing software for over 15 years. She is currently focussed on iOS development and has published several apps in the App Store. She is currently the Director of Mobile Development at Invicara, a startup based in Ann Arbor and does some freelance mobile development/consulting in her spare time.</p> <p><br/>Ravi Desai has been working diligently on his Swift talk for CodeMash (shameless plug).  He has a very quick lightning talk titled \"Two impossible things in Swift\".</p> ","name":"Short Talks & Open QA","id":"219145620"},{"yes_rsvp_count":24,"time":1423783800000,"link":"https://www.meetup.com/A2-CocoaHeads/events/219558644/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p>Our main meeting will start at 7pm and will feature a talk called \"Be proactive, use reactive!\" by Kevin Vitale. </p> <p>Today‘s apps contain a lot of moving parts, and juggling this complexity is what makes or breaks the user experience. In order to keep our sanity and reduce the amount of bugs that get shipped, we need to raise our level of abstraction. ReactiveCocoa (RAC) is a framework that brings the (functional) reactive programming world into the grossly imperative land of iOS. It builds off of Cocoa's own key-value observing mechanism to provide a high-level, declarative API for composing operations on streams of data, state, and asynchronous tasks. You’ll leave this session with a solid foundation of RAC and how one can apply it in conjunction with powerful tools like MVVM to build applications.</p> <p><br/>As always, if you are interested in speaker, please contact Dave Koziol</p> ","name":"Be proactive, use reactive!","id":"219558644"},{"yes_rsvp_count":34,"time":1426199400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/220653605/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community.</p> <p><br/>Our main meeting will start at 7pm and will feature a talk on WatchKit and how to write Apple Watch applications.</p> <p>As always, if you are interested in speaker, please contact Dave Koziol</p> ","name":"WatchKit and how to write Apple Watch applications","id":"220653605"},{"yes_rsvp_count":21,"time":1428618600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/221242796/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk on Multitasking Support on iOS.</p> <p>Ever wondered how some of the apps on your iPhone/iPad always seem to launch with up-to-date information from the server? Or how the download of large file completes even after you switched out of the app to a different one while the download is still in progress? Find out how these and other such capabilities are enabled in this talk on multitasking support on the iOS platform. Multitasking is the ability to run multiple apps on the device at the same time. Previously available in restricted form to a certain category of apps, now with iOS7, Apple introduced some powerful advancements to this feature. The platform now uses an intelligent algorithm that guarantees optimal battery usage while ensuring that all apps get a fair chance to run in the background. Making this even more powerful is the ability for data transfers to occur even when the app is not running! This talk will discuss and demonstrate the multitasking capabilities on the iOS platform. This talk was previously presented at CodeMash 2015.</p> <p>Priya Rajagopal has been professionally developing software solutions for over 15 years. She is currently leading the mobile development efforts at a startup in Ann Arbor, Michigan. She is an active member of the local mobile development community and co-organizes the Mobile Monday, Ann Arbor meetup group. Prior to mobile development, she worked on a range of technologies including IPTV, Social TV, targeted advertising, network management and platform security and is a co-inventor of several US patents. </p> <p>As always, if you are interested in speaker, please contact Dave Koziol </p> ","name":"Multitasking Support on the iOS Platform","id":"221242796"},{"yes_rsvp_count":32,"time":1431642600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/221975349/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk on Using Bluetooth to connect your app to the Internet of Things.</p> <p><br/>Bluetooth Low Energy (BLE) has become a ubiquitous standard for connecting devices of all types to each other and to cloud services.  Mobile apps can leverage BLE in a variety of ways, for example by adding proximity and context via iBeacons, interfacing with Bluetooth peripherals, and adding real-time wireless control over Bluetooth-enabled machines and devices.</p> <p>This developer-focused session will provide an overview of use cases and capabilities BLE enables for app developers. After a concept introduction, we'll dive into the code required to add BLE capabilities, and finally demonstrate BLE-enabled apps that interface with microcontrollers and iBeacons.  Code and demos will use iOS and Swift, but the concepts and techniques apply equally to OSX and Android platforms.</p> <p>About Robert Kerr</p> <p>Rob is the founder of Mobile Toolworks, where he helps startup and established companies reinvent their businesses using cloud-enabled mobile technologies.</p> <p>Rob became an entrepreneur early on, starting a custom software business while in college. Subsequently he played instrumental roles helping build a series of successful technology companies.</p> <p>He received a degree in Computer Information Systems from Western Michigan University, holds patents in connected device sensor analysis, was awarded Microsoft's Most Valued Professional (MVP) for his tech community contributions, and held software engineering, consulting and executive-level management positions prior to founding Mobile Toolworks.</p> ","name":"Use Bluetooth to connect your app to the Internet of Things","id":"221975349"},{"yes_rsvp_count":11,"time":1433782800000,"link":"https://www.meetup.com/A2-CocoaHeads/events/221973211/","description":"<p>Bring your own food, and join us to watch the WWDC keynote.</p> <p>Note: Time is an estimate based on past experience, it will be updated as the event gets closers.</p> ","name":"WWDC Keynote Viewing","id":"221973211"},{"yes_rsvp_count":21,"time":1434668400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/221973119/","description":"<p>One week later than usual, to avoid conflicting with WWDC.</p> <p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com/\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p><br/>Our main meeting will start at 7pm and will feature a discussion of announcements and developments from WWDC 2015</p> <p>As always, if you are interested in speaker, please contact Dave Koziol </p> ","name":"WWDC Recap","id":"221973119"},{"yes_rsvp_count":26,"time":1436481000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/223442716/","description":"<p>Become a better Cocoa developer </p> <p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk on Becoming a Better Cocoa Developer by Kevin Vitale.</p> <p>What makes a good Cocoa developer good? In this talk, Kevin reveals this one pro-tip that has made a significant difference in how he approaches his current Cocoa development cycle. In doing so, he hopes to inspire follow Cocoa artisans with a new perspective, and to further strengthen craftsmanship in our community.</p> ","name":"Become a better Cocoa developer with this one simple trick!","id":"223442716"},{"yes_rsvp_count":21,"time":1439505000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/224416169/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk on The Future, Promises and PromiseKit by Jeffrey Thomas.</p> <p>Asynchronous coding is a pain. Delegates divide the logic forcing developers to hunt for the next line of code. Completion blocks can result in nesting nightmares and/or redundant error handling. There is a better way. Promises are a great but underused method for handling asynchronous tasks on Apple platforms. In Cocoa and Cocoa Touch, PromiseKit is the most widely used promise API. In this presentation, you will learn the underlying ideas surrounding promises, PromiseKit's  implementation of promises, and advanced uses of promises. Jeff Thomas is a software developer with 16 years of professional experience. He works on mobile apps designed for automotive professionals like GM Dealer SalesAssistant, and Service Workbench Menu &amp; Inspection Toolkit. Jeff has a passion for minimalist code, user-centered design, and continuous integration.</p> <p>As always, if you are interested in speaker, please contact Dave Koziol.</p> ","name":"The Future, Promises and PromiseKit","id":"224416169"},{"yes_rsvp_count":8,"time":1441924200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/225231025/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature an open discussion of tvOS as well as Share a Tip time.</p> <p>You've got 26 hours, go read up on tvOS, and come up with tips to share on either tvOS or general iOS development. </p> <p>If you aren't familiar with the Share a Tip concept.  The idea is that as many people as possible share some information about something that makes them more productive as a developer.  It can be anything from Xcode tips, tools, websites, books or thought processes.  If possible, please try to come with something that has made you more productive recently.</p> ","name":"tvOS & Share a Tip Night","id":"225231025"},{"yes_rsvp_count":15,"time":1444343400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/225527122/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk on Pushing Objective-C Protocols to their Limit by Kevin Vitale.</p> <p>Objective-C protocols enable well defined contracts in our code's architecture. In this talk, Kevin will explore how protocols are utilized for more than just the standard delegation pattern we're used to, including showing how protocols can even be tricked into acting as their own class types.</p> ","name":"Pushing Objective-C Protocols to their Limit","id":"225527122"},{"yes_rsvp_count":20,"time":1447371000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/226402683/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk by Leo Dion, and it will be our first meeting after the Apple TV with App Store officially ships.</p> <p>Leo just got back from a great conference: ReleaseNotes in Indianapolis. At it's core releasenotes was a conference about building great businesses, and was targeted for Apple Developers like himself. He got to meet the makers of great apps such as Desk, Sketch, Capo, Sleep++, Perch, and more. At the meeting, he will talk about some of the main topics of the conference such as the importance of marketing and developing for the right audience.</p> <p>Leo is the owner of BrightDigit in Lansing, Michigan. He is married and has two little kids who keep him active and busy. He has been active doing research into app possibilities with the Apple Watch and Apple TV and has worked on apps for other companies such as CME Genius and Jackson as well as his own presentation timer app TicTalkToc. </p> <p>Leo recently took on the role of Chairperson of the Mobile Monday Lansing Planning Committee for the Mobile Technology Assn of Michigan and also runs the JavaScript group in Lansing as well.</p> <p><b>Stack Views By Keith Bourne</b></p> <p>New in iOS9+/Xcode 7+, the stack view provides a streamlined interface for laying out a collection of views in either a column or a row.  If you've developed on Android, this may sound familiar... linear layouts anyone?  Except, I would say Apple took linear layouts and made them much easier to use, compared to Android's version.  I'll try to convince you of why that is and share some of the cool UI things you can do with stack views along the way.  </p> <p><br/><i>Keith Bourne</i> is a Senior Software Engineer and Mobile Strategist for an Ann Arbor based mobile health startup called <a href=\"http://www.joolhealth.com/\">JOOL Health</a> (<a href=\"http://www.joolhealth.com/\"><a href=\"http://www.joolhealth.com/\" class=\"linkified\">http://www.joolhealth.com/</a></a>), as well as the founder of <a href=\"http://appervasive.com\">Appervasive</a> (<a href=\"http://appervasive.com/\"><a href=\"http://appervasive.com\" class=\"linkified\">http://appervasive.com</a></a>), focused on mobile strategy and user experience research. With his mobile experiences dating back to the 90’s, Keith is one of the most experienced mobile strategy professionals in the field. Keith speaks often and has been published through articles, papers, and interviews on many mobile strategy related topics.  Keith is a founding board member of the Mobile Technology Association of Michigan (MTAM) and co-founder of multiple network groups, including the Michigan chapter of Mobile Monday, which has grown to thousands of members and 4 chapters across the state of Michigan.</p> ","name":"ReleaseNotes Conference Recap, Apple TV, & Stack Views","id":"226402683"},{"yes_rsvp_count":18,"time":1449790200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/227120186/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk by Ravi Desai.</p> <p>Even if you never plan on programming on or for an Apple device, there are some very interesting concepts in Swift. Many of these concepts address issues relevant to developers in other languages and frameworks. Swift's unique view on the world can might help inform your development methodologies even if you never use it.</p> ","name":"Protocol Oriented Programming: a philosophical view of Swift","id":"227120186"},{"yes_rsvp_count":26,"time":1452814200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/227418739/","description":"<p><img src=\"http://photos2.meetupstatic.com/photos/event/7/c/d/2/600_445111954.jpeg\" /></p> <p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk by Chris Dzombak.</p> <p>In this talk, Chris covers what App Transport Security is and why it matters. He’ll briefly discuss how ATS fits in with other security choices, like “normal” HTTPS and certificate pinning. He’ll survey some popular apps to see who’s using it, and finally he’ll review how you should start using App Transport Security in your own apps—even if your servers aren’t (yet) using best-practice HTTPS configurations or your apps need to handle arbitrary user-submitted URLs.</p> <p>This talk is based on a post from <a href=\"https://www.dzombak.com/blog/2015/09/Nobody-is-using-App-Transport-Security--what-s-next-.html\">Chris' blog</a>, which was featured in <a href=\"http://iosdevweek.ly/\">iOS Dev Weekly</a>.</p> ","name":"Nobody is using App Transport Security; what’s next?","id":"227418739"},{"yes_rsvp_count":23,"time":1455233400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/228428485/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk by Chris Adamson titled \"Revenge of the 80s\".</p> <p>When the first 128K Macs landed in 1984, it was the first time many of us could undo a mistake with just a keystroke, or exchange data between documents or applications with cut/copy/paste and the system clipboard. Fast forward 30 years and we all use this stuff… but do you know how to actually implement it? Especially on iOS, these everyday features are surprisingly absent from many developers' toolchests. In this session, we'll flashback to the era of Reagan, Rubik's Cubes, and Return of the Jedi, to see these hot hits of the early 80's are represented in modern-day Cocoa.</p> <p><br/>Chris Adamson is the co-author of <a href=\"https://pragprog.com/book/adios2/ios-8-sdk-development\">iPhone 8 SDK Development</a> (Pragmatic Programmers) and <a href=\"http://is.gd/UEDYe4\">Learning Core Audio</a> (Addison-Wesley Professional). He is a software engineer at <a href=\"https://www.rev.com/\">Rev.com</a>, working remotely from Grand Rapids, Michigan, where he also writes the <a href=\"http://www.subfurther.com/blog\">[Time code]; blog</a>. Over the years, he has managed to own thirteen and a half Macs.</p> ","name":"Revenge of the 80s","id":"228428485"},{"yes_rsvp_count":17,"time":1457652600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/229359602/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p><img src=\"http://photos1.meetupstatic.com/photos/event/9/2/6/8/600_447577480.jpeg\" /></p> <p>Our main meeting will start at 7pm and will feature a talk to be announced very soon. Kevin presents the state of server-side Swift: what it is (and isn't), how to write it, and what's needed to get it deployed. </p> <p>Additionally, the talk includes an examination of writing flexible, resilient Swift client code to speak with your shiny new Swift-powered JSON services!</p> <p><br/>Expect few slides, lots of live-coding, and answers to any and (hopefully) all your Swift inquiries!</p> ","name":"Server-side Swift: What is it, and how does it work","id":"229359602"},{"yes_rsvp_count":27,"time":1460673000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/229698024/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk to be announced very soon. Nelida Velazquez will be presenting on various iOS application architectures.</p> <p>In this presentation we'll talk about the most popular options you have to architect iOS Applications: MVC, MVP, MVVM and Viper, but beyond that the goal is to discuss some basic principles that will help us to build a clean architecture, independent of the model you choose.</p> ","name":"Architecting iOS Applications, by Nelida Velazquez","id":"229698024"},{"yes_rsvp_count":22,"time":1463092200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/230989900/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk by Shawn Platkus on Internationalization and a Cross Platform Localization Solution</p> <p>Localization and Internationalization of software is often an afterthought for many projects.  This presentation will reveal why it is important to develop software with international users in mind even when support for a specific language or region is not planned.  Also, a method for localizing a project on Apple’s platforms will be presented in a solution that can be applied across multiple platforms.</p> <p><br/>Shawn has been developing software professionally since 1986.  His interest in computers started in grade school with the Apple 2.  Since then, Shawn has always had a passion for Apple’s products and platforms.  In 1997, he decided to pursue a career developing software for the Macintosh at the peak of Apple’s doom.  This turned out to be a pretty good career move and today he works at Xitron in Ann Arbor where he engineers and develops cross-platform client-server software for the printing industry.</p> ","name":"Internationalization and a Cross Platform Localization Solution","id":"230989900"},{"yes_rsvp_count":16,"time":1465511400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/231096230/","description":"<p><img src=\"http://www.tfxbrasil.com/wp-content/uploads/2014/06/tfx-apple-swift-logotipo.jpg\" /></p> <p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk, \"Awesome JSON Requests, in Swift\" by Kevin Vitale. In typical Kevin-fashion, the talk will be freeform with little slides and lots of live coding. </p> <p>In this talk, we discuss how to:</p> <p>- leverage Swift's type-system, rather fight it;<br/>- create solutions for flexible JSON-to-model parsing;<br/>- gracefully handle errors;<br/>- make your network code leaner while more resilient;<br/>- reduce third-party dependencies</p> <p><b><br/></b></p> <p><b>Full disclosure:</b> There will be <i>some </i>functional code, and it was be incredible!</p> ","name":"Awesome JSON Requests, in Swift","id":"231096230"},{"yes_rsvp_count":21,"time":1468535400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/232139796/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk by Dave Koziol on Firebase: Through the Eyes of the Tech Trek App</p> <p>Firebase includes a diverse set of functionality which can find a place in most iOS applications. This talk will start with an overview of what you can do with it, with a specific focus on the feature we used in the A2 Tech Trek app. We'll dive into code from the app, and look at things in our Firebase console. </p> <p>Dave has been working in the Apple world for over 20 years, and has worked on multiple top 5 apps in the iTunes store. He went to Google IO and WWDC this year,  and is excited about the potential of Firebase.</p> ","name":"Firebase: Through the Eyes of the Tech Trek App","id":"232139796"},{"yes_rsvp_count":19,"time":1470954600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/233211629/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk by Dave Koziol on Beacons</p> <p>Beacons allow application to be more aware of a users proximity. In this talk, we'll cover supporting beacons with CoreLocation, and some of our experiences from deploying almost a dozen different beacon applications. </p> <p>Dave has been working in the Apple world for over 20 years, and has worked on multiple top 5 apps in the iTunes store.  He is President of Arbormoon Software, and an organizer of CocoaHeads Ann Arbor.</p> ","name":"iBeacons","id":"233211629"},{"yes_rsvp_count":13,"time":1473267600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/233773976/","description":"<p>Apple's having a keynote, so we're having a keynote viewing party. If you want to watch the new announcements with other Apple geeks, grab some food, and come over to the Arbormoon office. Please RSVP so we make sure we have enough chairs out. But note that food will not be provided, but you are welcome to bring something to eat while you watch.</p> ","name":"Apple Announcement Viewing","id":"233773976"},{"yes_rsvp_count":39,"time":1473373800000,"link":"https://www.meetup.com/A2-CocoaHeads/events/233451248/","description":"<p><img src=\"http://photos3.meetupstatic.com/photos/event/1/4/6/600_453240326.jpeg\" /></p> <p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk by Andrew Sardone on React Native.</p> <p>React Native was publicly released slightly more than a year ago. It hit the scene with the motto, “learn once, write anywhere,” but what does this mean? In this talk, Andrew introduces React's declarative approach to writing user interfaces, and demonstrate how it's a significantly more manageable model for writing amazing <b>native apps</b>. We'll explore how React Native boosts your team's productivity by reducing knowledge silos, increasing collaboration, and unifying concepts, architecture, and code that's shared amongst iOS, Android, and web.</p> ","name":"Engineering Better Apps with React Native","id":"233451248"},{"yes_rsvp_count":22,"time":1476397800000,"link":"https://www.meetup.com/A2-CocoaHeads/events/234233851/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk by Eric Shapiro on Porting Graphing Calculator from macOS to iOS.</p> <p>Eric Shapiro will demo Pacific Tech Graphing Calculator for iOS and discuss how he ported the venerable Mac application to iOS without rewriting large swaths of code. The discussion will include similarities and differences between macOS and iOS along with various approaches that can be used to share code between platforms. </p> <p>For those not familiar with the colorful history of Graphing Calculator, listen to the This American Life podcast on the subject: </p> <p><a href=\"http://tinyurl.com/TALGraphicCalc\"><a href=\"http://tinyurl.com/TALGraphicCalc\" class=\"linkified\">http://tinyurl.com/TALGraphicCalc</a></a></p> ","name":"Porting Graphing Calculator from macOS to iOS","id":"234233851"},{"yes_rsvp_count":7,"time":1477587600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/235087245/","description":"<p>Apple's having a keynote, so we're having a keynote viewing party. If you want to watch the new announcements with other Apple geeks, grab some food, and come over to the Arbormoon office. Please RSVP so we make sure we have enough chairs out. But note that food will not be provided, but you are welcome to bring something to eat while you watch.</p> ","name":"Apple \"hello again\" keynote viewing","id":"235087245"},{"yes_rsvp_count":22,"time":1478820600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/234947126/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk by Jeffery Thomas called Be Nice to Your Future Self: Writing Code to Optimize Maintainability.</p> <p>At many times in my career, my future self has been very angry at my past self. Sometimes it's <i>clever</i> code that is completely unreadable. Other times, its complex object hierarchies that cause confusion. There have been a number of <i>premature optimizations</i> gone awry. However most times, it's just the right code written in the wrong place.</p> <p>Over time, I started seeing problems. I started to see my future self, or some other developer, and the work needed to sort out the mess I’m creating. Code is written once (or a least a small number of times), but it could be read hundreds of times. I learned the value of optimizing maintainability.</p> <p>I will turn use cases in to promises (PromiseKit), extend framework classes to provide the needed toolset, document the app-wide layout and assumptions, and demonstrate a VIPER-like architecture for a simple app.</p> ","name":"Be Nice to Your Future Self: Writing Code to Optimize Maintainability","id":"234947126"},{"yes_rsvp_count":13,"time":1484263800000,"link":"https://www.meetup.com/A2-CocoaHeads/events/236798056/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. Our main meeting will start at 7pm and will feature a talk by Doug Lance. Doug will show you how to build a Swift API intermediary between your code and any third-party API. Doug will share the reasons why this is a good idea and can sometimes be a bad idea. Most of all, he will teach you how to prevent your application from exploding when that API you love changes its syntax.</p> <p>Doug Lance is the founder of eFiction Publishing, LLC., which publishes six monthly fiction magazines to a global audience. He also does DevOps and iOS development for Arbormoon Software, Inc.</p> ","name":"Why Your App Should Never Call an External API and How to Fix it With Swift","id":"236798056"},{"yes_rsvp_count":21,"time":1486683000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/236973560/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p><br/>Our main meeting will start at 7pm and will feature a talk by Tom Crawford. </p> <p>What’s in a name? Choosing names is hard. Variables, functions, apps, and (apparently) kits are hard to name. You would think that ResearchKit is just for, well, research. During this session we’ll take a look at what ResearchKit can (and cannot) do, from consent (and other legal) documents to research (and other surveys) to accessing sensors. It is both powerful and limited at the same time. Come learn how ResearchKit may be able a powerful option (sometimes, in certain situations, where your needs match Apple’s choices).</p> <p><br/>Tom Crawford has been involved with technology almost as long as he can remember, working on everything from punch cards to Swift. He currently spends his days as Senior Developer for Curo, and his nights running Moveable Bytes—an iOS (and a little Android) development shop with over 20 apps on the app stores—and teaching iOS development at Washtenaw Community College.</p> ","name":"ResearchKit: A Nom de Course","id":"236973560"},{"yes_rsvp_count":20,"time":1489102200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/237227773/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by Arbormoon Software, Inc. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk by Chris Adamson on Media Framworks and Swift. </p> <p>Swift is great for writing iOS and Mac apps, and its creators also mean for it to be used as a systems programming language. However, certain traits about Swift make it officially off-limits for use in some audio/video-processing scenarios. What's the deal, is it not fast enough or what? We'll look at what media apps can and can't do in Swift, and what you're supposed to do instead. We'll also look at strategies for knowing what responsibilities to dole out to Swift and to C, and how to make those parts of your code play nicely with each other.</p> <p>Chris Adamson is the co-author of iPhone 8 SDK Development (Pragmatic Programmers) and Learning Core Audio (Addison-Wesley Professional). He is a software engineer at Rev.com, working remotely from Grand Rapids, Michigan, where he also writes the [Time code]; blog at <a href=\"http://www.subfurther.com/blog\" class=\"linkified\">http://www.subfurther.com/blog</a>. Over the years, he has managed to own thirteen and a half Macs.</p> ","name":"Media Frameworks and Swift: This Is Fine","id":"237227773"},{"yes_rsvp_count":19,"time":1492122600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/239119103/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. </p> <p>Our main meeting will start at 7pm and will feature a talk by Dave Koziol on Building a chat app together. </p> <p>This month we are going to build a basic Firebase realtime chat <a href=\"https://codelabs.developers.google.com/codelabs/firebase-ios-swift/#0\">demo</a> together. If you want to follow along, bring your laptop with Xcode 8.3, and CocoaPods installed and ready to go.</p> <p>Dave has been working in the Apple world for over 20 years, and has worked on multiple top 5 apps in the iTunes store.  He is President of <a href=\"http://www.arbormoon.com\">Arbormoon Software</a>, an organizer of CocoaHeads Ann Arbor, and a FireBase fan.</p> ","name":"Build a chat app together!","id":"239119103"},{"duration":10800000,"yes_rsvp_count":12,"time":1493492400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/239408873/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Feel free to stop by for part of the time, or the entire three hours. It is a more casual event than most Cocoaheads meetups.</p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB: The Monthly Cocoa Hack-a-thon","id":"qxplxmywgbmc"},{"duration":7200000,"yes_rsvp_count":21,"time":1494541800000,"link":"https://www.meetup.com/A2-CocoaHeads/events/239823842/","description":"<p>For the past few months, the number one question being asked during Cocoaheads meetings is, \"How do I use Xcode's debugging features?\" At this meeting, Doug and Kevin will finally answer that question! </p> <p>With so many knobs and switches, Xcode can be overwhelming for both new and seasoned developers. Kevin and Doug will reveal the kernels of greatest practical utility for working engineers.</p> <p><br/>Starting at 6:30pm, we'll have complimentary pizza and pop sponsored by Arbormoon Software. The presentation will begin at 7pm. </p> <p>Please RSVP now so we can estimate how much pizza to order.</p> <p><b>Meeting Schedule: </b><br/>6:30pm - 7:00pm -- Pizza &amp; Pop<br/>7:00pm - 8:00pm -- Main Presentation</p> <p><i>Kevin Vitale</i> is a co-organizer of Ann Arbor CocoaHeads. He is a Software Development Consultant for TD Ameritrade working on their thinkorswim™ active trading platform. He has also contributed code to just about every tech company in Ann Arbor. </p> <p><i>Doug Lance</i> is a co-organizer of Ann Arbor CocoaHeads. He is a Software Engineer working on iOS projects at Arbormoon Software, Inc. Also, he has had Apple AirPods surgically grafted to his ears.</p> ","name":"Debugging Swift 3 code with Xcode 8: Using the Latest Tools to Squash Bugs!","id":"239823842"},{"duration":10800000,"yes_rsvp_count":6,"time":1495911600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/239600979/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB","id":"qxplxmywhbkc"},{"duration":7200000,"yes_rsvp_count":12,"time":1496682000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/240447700/","description":"<p>Pull up a chair with your fellow CocoaHeads to find out what we will spend the next year of our professional lives debugging. </p> <p><b>At 1PM on Monday, June 5th, </b>Tim Cook (and friends) will present Apple's business performance from the last year, as well as announce what's new in iOS, watchOS, and tvOS. We may also get some hardware refreshes or even maybe brand new products (Siri speaker perhaps?). There are a lot of rumors swirling, and this WWDC will surely be one to remember.</p> <p><b>Pizza and refreshments will be provided courtesy of Arbormoon Software, Inc. </b></p> <p>Take a long lunch and join us. Your boss will understand. <b>Please RSVP now. </b>Seats are limited. Thanks! See you Monday!</p> ","name":"WWDC 2017 Keynote Viewing Party","id":"240447700"},{"yes_rsvp_count":6,"time":1497567600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/240796655/","description":"<p>Come join your fellow Cocoa developers as we casually talk about the latest WWDC announcement over drinks. We will discuss the implications of AR, machine learning, and other buzzwords that we will spend the next year debugging.</p> ","name":"Cocoa WWDC Drinks","id":"240796655"},{"duration":10800000,"yes_rsvp_count":18,"time":1498330800000,"link":"https://www.meetup.com/A2-CocoaHeads/events/239649281/","description":"<p><b>Learn how to drive new features using Test Driven Development (TDD) in Swift.</b></p> <p>I am very pleased to announce, we have a special guest instructor for this month's Codelab, Godfrey Nolan.</p> <p><b>Godfrey Nolan </b>is president of <i>RIIS,</i> LLC., where he specializes in website optimization. He has written numerous articles for magazines and newspapers in the United States, the United Kingdom, and Ireland. Nolan has had a healthy obsession with reverse engineering bytecode since he wrote <i>Decompile Once</i><i>, Run Anywhere</i>, which first appeared in <i>Web Techniques</i> in September 1997.</p> <p>This is a <b>B.Y.O.M.B.</b> event, <i>Bring Your Own MacBook</i>. </p> <p>Mr. Nolan will be teaching us about Test Driven Development with Swift: </p> <p>\"At its core TDD is a simple cycle:  Write a test, write as little code as possible to make the test pass, and then refactor or tidy up the code.  It sounds deceptively simple, but mobile apps and iOS in particular don't lend themselves to writing code using this approach. Instead you find yourself jumping back into and out of Xcode's Interface Builder which constantly breaks up the test, code and refactor TDD cycle.But what if you could code an iOS app without using the Interface Builder?</p> <p><br/>In this workshop we'll create a simple iOS transit app written in Swift but without using the Interface Builder.  This will allows us to re-establish the test-code-refactor TDD cycle for Swift which you can then use in your own apps.\"</p> <p><br/>I am really excited to see you all at the Codelab. Thanks so much Mr. Nolan for coming out to teach us.  </p> <p>Please RSVP now. Seats are limited. First come, first serve!</p> <p><b>Reminder</b>: Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p><i>P.S. After the Codelab, interested parties are invited for dinner and drinks somewhere in downtown Ann Arbor.</i></p> ","name":"COCOA CODELAB: Learn Test Driven Development (TDD) in Swift","id":"qxplxmywjbgc"},{"duration":10800000,"yes_rsvp_count":10,"time":1503774000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/240234101/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB","id":"qxplxmywlbjc"},{"yes_rsvp_count":13,"time":1505233800000,"link":"https://www.meetup.com/A2-CocoaHeads/events/243202336/","description":"<p>Join your fellow CocoaHeads at Arbormoon HQ to watch Apple's announcement of the new iPhone(s), new products, and release dates. </p> <p>Next Tuesday, grab your Apple-minded co-workers for lunch at the Arbormoon offices. Pizza and soft drinks courtesy of Arbormoon. </p> <p>Please prepare your wallets before attending. Apple is coming for your disposable income... </p> <p><br/>See you there! </p> ","name":"Apple Special Event Viewing Party","id":"243202336"},{"yes_rsvp_count":20,"time":1505428200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/242777090/","description":"<p>With Swift 4 and Xcode 9 coming out this fall, Leo Dion of BrightDigit, will be going over some of the quirks and challenges people face with Swift, the changes coming with Swift 4, and what has been proposed for Swift 5. It will be an engaging talk so come with your most challenging problems with Swift as well as your questions and ideas. </p> <p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. Our main meeting will start at 7pm and will feature the talk by Leo Dion.</p> <p>Leo is the owner of BrightDigit in Lansing, Michigan. He is married and has five little kids who keep him active and busy. With over 6 years of experience in iOS development, he has been an active user of Swift and recently taken an active interest in not only developing for the Apple Watch but also the Mac.</p> ","name":"Swift 4 and Advanced Tips and Tricks with Leo Dion","id":"242777090"},{"duration":10800000,"yes_rsvp_count":5,"time":1506798000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/241203418/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB","id":"qxplxmywmbnc"},{"yes_rsvp_count":8,"time":1507847400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/242831836/","description":"<p>Starting at 6:30pm, we'll have free food sponsored by <a href=\"http://www.arbormoon.com\">Arbormoon Software, Inc</a>. Please RSVP to help us estimate how much food we need. While you are enjoying the food, talk with other developers and network in the local Cocoa community. Our main meeting will start at 7pm and will feature a talk by Colt Correa on the Technical challenges for creating a wearable real-time body motion tracking system for a iOS. </p> <p>Topics:<br/>1. Basics of body action tracking, algorithms and methods. What can and cannot be accomplished with today's IMU's.<br/>2. Real-time BLE communication using multiple BLE devices to a single smart phone.<br/>3. Power management battery life for a wearable system.<br/>4. Unity3D integration.<br/>5. Open source, open interface system for real-time body tracking.</p> <p>The topic comes from Colt's work on <a href=\"http://www.mydigibit.com/\">DigiBit</a>. They have an active <a href=\"https://www.kickstarter.com/projects/1039276273/digibit-is-wearable-active-fun-for-your-mobile-dev\">Kickstarter</a> campaign. He will be able to talk about DigiBit's experiences around that as well as far as what someone can and should not expect from Kickstarter. </p> <p>Colt holds a Master of Science in Electrical Engineering from the University of Michigan. He has more than 22 years of experience writing embedded hardware and software for the automotive industry. He has led numerous multinational teams focused on electronics software and hardware development. Colt has authored several IEEE and SAE publications, wrote a 1,100 page book \"Automotive Ethernet - The Definitive Guide\" and has been awarded 5 U.S. patents.</p> ","name":"Challenges creating a wearable real-time body motion tracking system","id":"242831836"},{"duration":10800000,"yes_rsvp_count":4,"time":1509217200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/242023951/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB","id":"qxplxmywnblc"},{"duration":10800000,"yes_rsvp_count":3,"time":1511640000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/qxplxmywpbhc/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB","id":"qxplxmywpbhc"},{"duration":10800000,"yes_rsvp_count":3,"time":1514664000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/qxplxmywqbnc/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB","id":"qxplxmywqbnc"},{"duration":10800000,"yes_rsvp_count":3,"time":1517083200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/qxplxmyxcbkc/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB","id":"qxplxmyxcbkc"},{"duration":10800000,"yes_rsvp_count":3,"time":1519502400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/qxplxmyxdbgc/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB","id":"qxplxmyxdbgc"},{"duration":10800000,"yes_rsvp_count":3,"time":1522522800000,"link":"https://www.meetup.com/A2-CocoaHeads/events/qxplxmyxfbpc/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB","id":"qxplxmyxfbpc"},{"duration":10800000,"yes_rsvp_count":3,"time":1524942000000,"link":"https://www.meetup.com/A2-CocoaHeads/events/qxplxmyxgblc/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB","id":"qxplxmyxgblc"},{"duration":10800000,"yes_rsvp_count":3,"time":1527361200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/qxplxmyxhbjc/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB","id":"qxplxmyxhbjc"},{"duration":10800000,"yes_rsvp_count":3,"time":1530385200000,"link":"https://www.meetup.com/A2-CocoaHeads/events/qxplxmyxjbnc/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB","id":"qxplxmyxjbnc"},{"duration":10800000,"yes_rsvp_count":3,"time":1532804400000,"link":"https://www.meetup.com/A2-CocoaHeads/events/qxplxmyxkblc/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB","id":"qxplxmyxkblc"},{"duration":10800000,"yes_rsvp_count":3,"time":1535223600000,"link":"https://www.meetup.com/A2-CocoaHeads/events/qxplxmyxlbhc/","description":"<p>The <b>Cocoa Codelab</b> is your opportunity to start, join, or share a project with your CocoaHeads compatriots. </p> <p>We take over the Arbormoon Software offices for a few hours to talk about what's new with Apple, iOS, and associated topics. </p> <p>This is a <b>BYOMB</b> event. Bring Your Own MacBook. </p> <p>Visit <a href=\"https://a2cocoa.slack.com/messages/codelab\">#codelab</a> to discuss projects before or after. If you're not a member, <a href=\"http://bit.ly/a2cocoa\">get an invitation</a>.</p> <p>After the Codelab, interested parties are invited for dinner and drinks somewhere downtown Ann Arbor.</p> ","name":"COCOA CODELAB","id":"qxplxmyxlbhc"}]